python_qam.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-02-25 Sun 22:06 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Python - QAM</title>
<meta name="author" content="shaka" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="default.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Python - QAM</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org4a6c020">Introduction</a></li>
<li><a href="#orgf8821d8">Source code</a></li>
</ul>
</div>
</div>

<div id="outline-container-org4a6c020" class="outline-2">
<h2 id="org4a6c020">Introduction</h2>
<div class="outline-text-2" id="text-org4a6c020">
<p>
In order to structure the utility relating to constellation modulation, I wrote a class <code>Quadrature_Amplitude_Modulation</code> in Python.
</p>
</div>
</div>
<div id="outline-container-orgf8821d8" class="outline-2">
<h2 id="orgf8821d8">Source code</h2>
<div class="outline-text-2" id="text-orgf8821d8">
<div class="org-src-container">
<pre class="src src-python">import numpy as np
import matplotlib.pyplot as plt

class Quadrature_Amplitude_Modulation:
    def __init__(self, mod_order: int) -&gt; None:
        """! Constructor for quadrature amplitude modulation (QAM)
        @param mod_order Modulation order, e.g., 4 for QPSK.
        """
        self.mod_order = mod_order
        self.bit_num_sym = int(np.log2(mod_order))
        m = np.sqrt(mod_order)
        v = np.linspace(1 - m, m - 1, int(m))
        x, y = np.meshgrid(v, v)
        self.const = np.reshape(x + 1j * y, -1) / np.sqrt((mod_order - 1) * 2 / 3)
        self.name = "QPSK" if mod_order == 4 else f"{mod_order}QAM"
    def calc_mi(self, sinr: float, sample_num: int=1000) -&gt; float:
        """! Calculate the per-symbol mutual information, a.k.a. RBIR, for the specified SINR.
        @param sinr SINR in dB
        @param sample_num Number of random samples
        @return Per-bit information
        """
        n_pwr = np.power(10, -0.1 * sinr)
        n = np.random.randn(sample_num) + 1j * np.random.randn(sample_num)
        n *= np.sqrt(n_pwr / 2)
        si = np.zeros((self.mod_order, sample_num))
        for sym_idx in range(self.mod_order):
            for sample_idx in range(sample_num):
                x = np.power(np.abs(self.const - self.const[sym_idx] + n[sample_idx]), 2) - np.power(np.abs(n[sample_idx]), 2)
                si[sym_idx][sample_idx] = np.sum(np.exp(-1 * x / n_pwr))
        return self.bit_num_sym - np.log2(si).mean()
    def visualize(self, ax: plt.Axes = None, **kwargs) -&gt; None:
        """! Visualize the constellation
        @param ax An axis object
        @param kwargs Keyword argument for further customization
        """
        if ax is None:
            _, ax = plt.subplots()
        ax.scatter(self.const.real, self.const.imag, **kwargs)
        ax.set_xlabel('In-phase')
        ax.set_ylabel('Quadrature')
        ax.set_title(self.name)
        ax.set_aspect('equal')
        ax.grid(True)
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
